flameletModel-2.3.x/tutorials/flameletSimpleFoam/Sandia_COH2N2/0/Zvar
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.2;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      csiv2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inletfuel           
    {
	type 		fixedValue;
        value           uniform 0;
    }

    inletair           
    {
	type 		fixedValue;
        value           uniform 0;
    }

    outlet          
    {
        type            zeroGradient;
    }

    sidewall       
    {
        type            zeroGradient;
    }

    burnerwall       
    {
        type            zeroGradient;
    }

    front    
    {
        type            wedge;
    }

    back    
    {
        type            wedge;
    }

    axis
    {
        type            empty;
    }
}
// ************************************************************************* //
